#include "include.h"

//==============================================================================
//上电延时
//==============================================================================
static void boot_delay (void)
{
	for (uint16_t i=0; i<5000; i++)
	{
		asm ("nop");
	}
}

//==============================================================================
//初始化时钟(Bootloard 里面已经初始化了，不需要再初始化)
//==============================================================================
/*static void boot_clk_init (void)
{
	//切换时钟(STM8 初始化为内部时钟 。 若使用外部时钟，需手动切换)
	CLK -> SWR = 0x04 ; 							//选择外部高速时钟
	while (CLK->CRTCR & (1<<0));
	
	//启动外部 12M 晶振
	CLK -> ECKCR |= (1<<0) ; 						//使能外部时钟
	CLK -> CKDIVR = 0x00;	 						//系统时钟 : 12M
	while (!(CLK->ECKCR & (1<<1)));
	
	CLK -> SWCR |= (1<<1)|(1<<2) ;
	while(!(CLK -> SWCR & (1<<3))) ;
	CLK -> SWCR &= ~(1<<3) ;
}*/


void boot (void)
{
  	boot_delay ();			//上电延时，等待晶体震荡稳定
	//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	// 注意 : 因为执行 Bootloard 时，已经初始化了时钟。所以此处不需要再初始化
	//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	//boot_clk_init ();	
  	//boot_delay ();			//稍作延时
	
	adc_Init();
	LED_UART1_Init();
	beep_Init();
	key_int();
	U3_Init();
	Init_EEPROM_Dat() ;
	initFRSKYD16();
	tbc_init ();
}